Revit 2027 API
AssetType Enumeration
 Enumerated asset types
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AssetType
Public Enumeration AssetType
public enum class AssetType
type AssetType
Members
Member name | Value | Description
Appearance | 4 |  Appearance assets (materials).
Content | 5 |  Content assets (RPC / entourage).
See Also
Reference
Autodesk.Revit.DB.Visual Namespace